RT-Thread/rt-thread/bsp/swm320/libraries/CMSIS/DeviceSupport/SWM320.h
#ifndef __SWM320_H__
#define __SWM320_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */
typedef enum IRQn
{
    /******  Cortex-M0 Processor Exceptions Numbers **********************************************/
    NonMaskableInt_IRQn = -14,   /*!< 2 Non Maskable Interrupt                        */
    MemoryManagement_IRQn = -12, /*!< 4 Cortex-M4 Memory Management Interrupt         */
    BusFault_IRQn = -11,         /*!< 5 Cortex-M4 Bus Fault Interrupt                 */
    UsageFault_IRQn = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt               */
    SVCall_IRQn = -5,            /*!< 11 Cortex-M4 SV Call Interrupt                  */
    DebugMonitor_IRQn = -4,      /*!< 12 Cortex-M4 Debug Monitor Interrupt            */
    PendSV_IRQn = -2,            /*!< 14 Cortex-M4 Pend SV Interrupt                  */
    SysTick_IRQn = -1,           /*!< 15 Cortex-M4 System Tick Interrupt              */

    /******  Cortex-M4 specific Interrupt Numbers ************************************************/
    GPIOA0_IRQn = 0,
    GPIOA1_IRQn = 1,
    GPIOA2_IRQn = 2,
    GPIOA3_IRQn = 3,
    GPIOA4_IRQn = 4,
    GPIOA5_IRQn = 5,
    GPIOA6_IRQn = 6,
    GPIOA7_IRQn = 7,
    GPIOB0_IRQn = 8,
    GPIOB1_IRQn = 9,
    GPIOB2_IRQn = 10,
    GPIOB3_IRQn = 11,
    GPIOB4_IRQn = 12,
    GPIOB5_IRQn = 13,
    GPIOB6_IRQn = 14,
    GPIOB7_IRQn = 15,
    GPIOC0_IRQn = 16,
    GPIOC1_IRQn = 17,
    GPIOC2_IRQn = 18,
    GPIOC3_IRQn = 19,
    GPIOC4_IRQn = 20,
    GPIOC5_IRQn = 21,
    GPIOC6_IRQn = 22,
    GPIOC7_IRQn = 23,
    GPIOM0_IRQn = 24,
    GPIOM1_IRQn = 25,
    GPIOM2_IRQn = 26,
    GPIOM3_IRQn = 27,
    GPIOM4_IRQn = 28,
    GPIOM5_IRQn = 29,
    GPIOM6_IRQn = 30,
    GPIOM7_IRQn = 31,
    DMA_IRQn = 32,
    LCD_IRQn = 33,
    NORFLC_IRQn = 34,
    CAN_IRQn = 35,
    PULSE_IRQn = 36,
    WDT_IRQn = 37,
    PWM_IRQn = 38,
    UART0_IRQn = 39,
    UART1_IRQn = 40,
    UART2_IRQn = 41,
    UART3_IRQn = 42,
    UART4_IRQn = 43,
    I2C0_IRQn = 44,
    I2C1_IRQn = 45,
    SPI0_IRQn = 46,
    ADC0_IRQn = 47,
    RTC_IRQn = 48,
    BOD_IRQn = 49,
    SDIO_IRQn = 50,
    GPIOA_IRQn = 51,
    GPIOB_IRQn = 52,
    GPIOC_IRQn = 53,
    GPIOM_IRQn = 54,
    GPION_IRQn = 55,
    GPIOP_IRQn = 56,
    ADC1_IRQn = 57,
    FPU_IRQn = 58,
    SPI1_IRQn = 59,
    TIMR0_IRQn = 60,
    TIMR1_IRQn = 61,
    TIMR2_IRQn = 62,
    TIMR3_IRQn = 63,
    TIMR4_IRQn = 64,
    TIMR5_IRQn = 65,
} IRQn_Type;

/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __CM4_REV 0x0001         /*!< Core revision r0p1                            */
#define __MPU_PRESENT 1          /*!< SWM320 provides an MPU                       */
#define __NVIC_PRIO_BITS 3       /*!< SWM320 uses 3 Bits for the Priority Levels   */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_PRESENT 0          /*!< FPU present                                   */

#if defined(__CC_ARM)
#pragma anon_unions
#endif

#include <stdio.h>
#include "core_cm4.h" /* Cortex-M0 processor and core peripherals		     */
#include "system_SWM320.h"

/******************************************************************************/
/*				Device Specific Peripheral registers structures			 */
/******************************************************************************/
typedef struct
{
    __IO uint32_t CLKSEL; //Clock Select

    __IO uint32_t CLKDIV;

    __IO uint32_t CLKEN; //Clock Enable

    __IO uint32_t SLEEP;

    uint32_t RESERVED0[6];

    __IO uint32_t RTCBKP_ISO; //[0] 1 RTC备份电源域处于隔离状态    0 RTC备份电源域可访问

    __IO uint32_t RTCWKEN; //[0] 1 使能RTC唤醒功能

    uint32_t RESERVED[52 + 64];

    __IO uint32_t PAWKEN; //Port A Wakeup Enable
    __IO uint32_t PBWKEN;
    __IO uint32_t PCWKEN;

    uint32_t RESERVED2[1 + 4];

    __IO uint32_t PAWKSR; //Port A Wakeup Status Register，写1清零
    __IO uint32_t PBWKSR;
    __IO uint32_t PCWKSR;

    uint32_t RESERVED3[64 - 10];

    __IO uint32_t RSTCR; //Reset Control Register
    __IO uint32_t RSTSR; //Reset Status Register

    uint32_t RESERVED4[61 + 64];

    __IO uint32_t BKP[3]; //数据备份寄存器

    //RTC Power Domain: 0x4001E000
    uint32_t RESERVED5[(0x4001E000 - 0x40000508) / 4 - 1];

    __IO uint32_t RTCBKP[8]; //RTC电源域数据备份寄存器

    __IO uint32_t LRCCR;    //Low speed RC Control Register
    __IO uint32_t LRCTRIM0; //Low speed RC Trim
    __IO uint32_t LRCTRIM1;

    uint32_t RESERVED6;

    __IO uint32_t RTCLDOTRIM; //RTC Power Domain LDO Trim

    //Analog Control: 0x40031000
    uint32_t RESERVED7[(0x40031000 - 0x4001E030) / 4 - 1];

    __IO uint32_t HRCCR; //High speed RC Control Register

    uint32_t RESERVED8[7];

    __IO uint32_t XTALCR;

    __IO uint32_t PLLCR;
    __IO uint32_t PLLDIV;
    __IO uint32_t PLLSET;
    __IO uint32_t PLLLOCK; //[0] 1 PLL已锁定

    __IO uint32_t BODIE;
    __IO uint32_t BODIF;

    __IO uint32_t ADC1IN7;
} SYS_TypeDef;

#define SYS_CLKSEL_LFCK_Pos 0 //Low Frequency Clock Source	0 LRC	1 PLL
#define SYS_CLKSEL_LFCK_Msk (0x01 << SYS_CLKSEL_LFCK_Pos)
#define SYS_CLKSEL_HFCK_Pos 1 //High Frequency Clock Source	0 HRC	1 XTAL
#define SYS_CLKSEL_HFCK_Msk (0x01 << SYS_CLKSEL_HFCK_Pos)
#define SYS_CLKSEL_SYS_Pos 2 //系统时钟选择	0 LFCK	1 HFCK
#define SYS_CLKSEL_SYS_Msk (0x01 << SYS_CLKSEL_SYS_Pos)

#define SYS_CLKDIV_SYS_Pos 0 //系统时钟分频  0 1分频    1 2分频
#define SYS_CLKDIV_SYS_Msk (0x01 << SYS_CLKDIV_SYS_Pos)
#define SYS_CLKDIV_PWM_Pos 1 //PWM 时钟分频  0 1分频    1 8分频
#define SYS_CLKDIV_PWM_Msk (0x01 << SYS_CLKDIV_PWM_Pos)
#define SYS_CLKDIV_SDRAM_Pos 2 //SDRAM时钟分频 0 1分频    1 2分频    2 4分频
#define SYS_CLKDIV_SDRAM_Msk (0x03 << SYS_CLKDIV_SDRAM_Pos)
#define SYS_CLKDIV_SDIO_Pos 4 //SDIO时钟分频  0 1分频    1 2分频    2 4分频     3 8分频
#define SYS_CLKDIV_SDIO_Msk (0x03 << SYS_CLKDIV_SDIO_Pos)

#define SYS_CLKEN_GPIOA_Pos 0
#define SYS_CLKEN_GPIOA_Msk (0x01 << SYS_CLKEN_GPIOA_Pos)
#define SYS_CLKEN_GPIOB_Pos 1
#define SYS_CLKEN_GPIOB_Msk (0x01 << SYS_CLKEN_GPIOB_Pos)
#define SYS_CLKEN_GPIOC_Pos 2
#define SYS_CLKEN_GPIOC_Msk (0x01 << SYS_CLKEN_GPIOC_Pos)
#define SYS_CLKEN_GPIOM_Pos 4
#define SYS_CLKEN_GPIOM_Msk (0x01 << SYS_CLKEN_GPIOM_Pos)
#define SYS_CLKEN_GPION_Pos 5
#define SYS_CLKEN_GPION_Msk (0x01 << SYS_CLKEN_GPION_Pos)
#define SYS_CLKEN_TIMR_Pos 6
#define SYS_CLKEN_TIMR_Msk (0x01 << SYS_CLKEN_TIMR_Pos)
#define SYS_CLKEN_WDT_Pos 7
#define SYS_CLKEN_WDT_Msk (0x01 << SYS_CLKEN_WDT_Pos)
#define SYS_CLKEN_ADC0_Pos 8
#define SYS_CLKEN_ADC0_Msk (0x01 << SYS_CLKEN_ADC0_Pos)
#define SYS_CLKEN_PWM_Pos 9
#define SYS_CLKEN_PWM_Msk (0x01 << SYS_CLKEN_PWM_Pos)
#define SYS_CLKEN_RTC_Pos 10
#define SYS_CLKEN_RTC_Msk (0x01 << SYS_CLKEN_RTC_Pos)
#define SYS_CLKEN_UART0_Pos 11
#define SYS_CLKEN_UART0_Msk (0x01 << SYS_CLKEN_UART0_Pos)
#define SYS_CLKEN_UART1_Pos 12
#define SYS_CLKEN_UART1_Msk (0x01 << SYS_CLKEN_UART1_Pos)
#define SYS_CLKEN_UART2_Pos 13
#define SYS_CLKEN_UART2_Msk (0x01 << SYS_CLKEN_UART2_Pos)
#define SYS_CLKEN_UART3_Pos 14
#define SYS_CLKEN_UART3_Msk (0x01 << SYS_CLKEN_UART3_Pos)
#define SYS_CLKEN_UART4_Pos 15
#define SYS_CLKEN_UART4_Msk (0x01 << SYS_CLKEN_UART4_Pos)
#define SYS_CLKEN_SPI0_Pos 16
#define SYS_CLKEN_SPI0_Msk (0x01 << SYS_CLKEN_SPI0_Pos)
#define SYS_CLKEN_I2C0_Pos 17
#define SYS_CLKEN_I2C0_Msk (0x01 << SYS_CLKEN_I2C0_Pos)
#define SYS_CLKEN_I2C1_Pos 18
#define SYS_CLKEN_I2C1_Msk (0x01 << SYS_CLKEN_I2C1_Pos)
#define SYS_CLKEN_I2C2_Pos 19
#define SYS_CLKEN_I2C2_Msk (0x01 << SYS_CLKEN_I2C2_Pos)
#define SYS_CLKEN_LCD_Pos 20
#define SYS_CLKEN_LCD_Msk (0x01 << SYS_CLKEN_LCD_Pos)
#define SYS_CLKEN_GPIOP_Pos 21
#define SYS_CLKEN_GPIOP_Msk (0x01 << SYS_CLKEN_GPIOP_Pos)
#define SYS_CLKEN_ANAC_Pos 22 //模拟控制单元时钟使能
#define SYS_CLKEN_ANAC_Msk (0x01 << SYS_CLKEN_ANAC_Pos)
#define SYS_CLKEN_CRC_Pos 23
#define SYS_CLKEN_CRC_Msk (0x01 << SYS_CLKEN_CRC_Pos)
#define SYS_CLKEN_RTCBKP_Pos 24
#define SYS_CLKEN_RTCBKP_Msk (0x01 << SYS_CLKEN_RTCBKP_Pos)
#define SYS_CLKEN_CAN_Pos 25
#define SYS_CLKEN_CAN_Msk (0x01 << SYS_CLKEN_CAN_Pos)
#define SYS_CLKEN_SDRAM_Pos 26
#define SYS_CLKEN_SDRAM_Msk (0x01 << SYS_CLKEN_SDRAM_Pos)
#define SYS_CLKEN_NORFL_Pos 27 //NOR Flash
#define SYS_CLKEN_NORFL_Msk (0x01 << SYS_CLKEN_NORFL_Pos)
#define SYS_CLKEN_RAMC_Pos 28
#define SYS_CLKEN_RAMC_Msk (0x01 << SYS_CLKEN_RAMC_Pos)
#define SYS_CLKEN_SDIO_Pos 29
#define SYS_CLKEN_SDIO_Msk (0x01 << SYS_CLKEN_SDIO_Pos)
#define SYS_CLKEN_ADC1_Pos 30
#define SYS_CLKEN_ADC1_Msk (0x01 << SYS_CLKEN_ADC1_Pos)
#define SYS_CLKEN_ALIVE_Pos 31 //CHIPALIVE电源域系统时钟使能
#define SYS_CLKEN_ALIVE_Msk (0x01 << SYS_CLKEN_ALIVE_Pos)

#define SYS_SLEEP_SLEEP_Pos 0 //将该位置1后，系统将进入SLEEP模式
#define SYS_SLEEP_SLEEP_Msk (0x01 << SYS_SLEEP_SLEEP_Pos)
#define SYS_SLEEP_DEEP_Pos 1 //将该位置1后，系统将进入STOP SLEEP模式
#define SYS_SLEEP_DEEP_Msk (0x01 << SYS_SLEEP_DEEP_Pos)

