RT-Thread/rt-thread/bsp/swm320/libraries/CMSIS/DeviceSupport/SWM320.h
#define RTC_TRIMM_CYCLE_Pos 0 /* 用于计数周期微调，如果INC为1，则第n个计数周期调整为(32768±ADJ)+1,否则调整为(32768±ADJ)-1 \
                              //cycles=0时，不进行微调整；cycles=1，则n为2；cycles=7，则n为8；以此类推 */
#define RTC_TRIMM_CYCLE_Msk (0x07 << RTC_TRIMM_CYCLE_Pos)
#define RTC_TRIMM_INC_Pos 3
#define RTC_TRIMM_INC_Msk (0x01 << RTC_TRIMM_INC_Pos)

typedef struct
{
    __IO uint32_t LOAD; //喂狗使计数器装载LOAD值

    __I uint32_t VALUE;

    __IO uint32_t CR;

    __IO uint32_t IF; //计数到0时硬件置位，软件写1清除标志

    __IO uint32_t FEED; //写0x55喂狗
} WDT_TypeDef;

#define WDT_CR_EN_Pos 0
#define WDT_CR_EN_Msk (0x01 << WDT_CR_EN_Pos)
#define WDT_CR_RSTEN_Pos 1
#define WDT_CR_RSTEN_Msk (0x01 << WDT_CR_RSTEN_Pos)

/******************************************************************************/
/*						 Peripheral memory map							  */
/******************************************************************************/
#define RAM_BASE 0x20000000
#define AHB_BASE 0x40000000
#define APB_BASE 0x40010000

#define NORFLC_BASE 0x60000000
#define NORFLM_BASE 0x61000000

#define SRAMC_BASE 0x68000000
#define SRAMM_BASE 0x69000000

#define SDRAMC_BASE 0x78000000
#define SDRAMM_BASE 0x70000000

/* AHB Peripheral memory map */
#define SYS_BASE (AHB_BASE + 0x00000)

#define DMA_BASE (AHB_BASE + 0x01000)

#define LCD_BASE (AHB_BASE + 0x02000)

#define CRC_BASE (AHB_BASE + 0x03000)

#define SDIO_BASE (AHB_BASE + 0x04000)

/* APB Peripheral memory map */
#define PORT_BASE (APB_BASE + 0x00000)

#define GPIOA_BASE (APB_BASE + 0x01000)
#define GPIOB_BASE (APB_BASE + 0x02000)
#define GPIOC_BASE (APB_BASE + 0x03000)
#define GPIOD_BASE (APB_BASE + 0x04000)
#define GPIOM_BASE (APB_BASE + 0x05000)
#define GPION_BASE (APB_BASE + 0x06000)
#define GPIOP_BASE (APB_BASE + 0x08000)

#define TIMR0_BASE (APB_BASE + 0x07000)
#define TIMR1_BASE (APB_BASE + 0x0700C)
#define TIMR2_BASE (APB_BASE + 0x07018)
#define TIMR3_BASE (APB_BASE + 0x07024)
#define TIMR4_BASE (APB_BASE + 0x07030)
#define TIMR5_BASE (APB_BASE + 0x0703C)
#define TIMRG_BASE (APB_BASE + 0x07060)

#define WDT_BASE (APB_BASE + 0x09000)

#define PWM0_BASE (APB_BASE + 0x0A000)
#define PWM1_BASE (APB_BASE + 0x0A020)
#define PWM2_BASE (APB_BASE + 0x0A040)
#define PWM3_BASE (APB_BASE + 0x0A060)
#define PWM4_BASE (APB_BASE + 0x0A080)
#define PWM5_BASE (APB_BASE + 0x0A0A0)
#define PWMG_BASE (APB_BASE + 0x0A180)

#define RTC_BASE (APB_BASE + 0x0B000)

#define ADC0_BASE (APB_BASE + 0x0C000)
#define ADC1_BASE (APB_BASE + 0x0D000)

#define FLASH_BASE (APB_BASE + 0x0F000)

#define UART0_BASE (APB_BASE + 0x10000)
#define UART1_BASE (APB_BASE + 0x11000)
#define UART2_BASE (APB_BASE + 0x12000)
#define UART3_BASE (APB_BASE + 0x13000)

#define I2C0_BASE (APB_BASE + 0x18000)
#define I2C1_BASE (APB_BASE + 0x19000)

#define SPI0_BASE (APB_BASE + 0x1C000)
#define SPI1_BASE (APB_BASE + 0x1D000)

#define CAN_BASE (APB_BASE + 0x20000)

/******************************************************************************/
/*						 Peripheral declaration							 */
/******************************************************************************/
#define SYS ((SYS_TypeDef *)SYS_BASE)

#define PORT ((PORT_TypeDef *)PORT_BASE)

#define GPIOA ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOM ((GPIO_TypeDef *)GPIOM_BASE)
#define GPION ((GPIO_TypeDef *)GPION_BASE)
#define GPIOP ((GPIO_TypeDef *)GPIOP_BASE)

#define TIMR0 ((TIMR_TypeDef *)TIMR0_BASE)
#define TIMR1 ((TIMR_TypeDef *)TIMR1_BASE)
#define TIMR2 ((TIMR_TypeDef *)TIMR2_BASE)
#define TIMR3 ((TIMR_TypeDef *)TIMR3_BASE)
#define TIMR4 ((TIMR_TypeDef *)TIMR4_BASE)
#define TIMR5 ((TIMR_TypeDef *)TIMR5_BASE)
#define TIMRG ((TIMRG_TypeDef *)TIMRG_BASE)

#define UART0 ((UART_TypeDef *)UART0_BASE)
#define UART1 ((UART_TypeDef *)UART1_BASE)
#define UART2 ((UART_TypeDef *)UART2_BASE)
#define UART3 ((UART_TypeDef *)UART3_BASE)

#define SPI0 ((SPI_TypeDef *)SPI0_BASE)
#define SPI1 ((SPI_TypeDef *)SPI1_BASE)

#define I2C0 ((I2C_TypeDef *)I2C0_BASE)
#define I2C1 ((I2C_TypeDef *)I2C1_BASE)

#define ADC0 ((ADC_TypeDef *)ADC0_BASE)
#define ADC1 ((ADC_TypeDef *)ADC1_BASE)

#define PWM0 ((PWM_TypeDef *)PWM0_BASE)
#define PWM1 ((PWM_TypeDef *)PWM1_BASE)
#define PWM2 ((PWM_TypeDef *)PWM2_BASE)
#define PWM3 ((PWM_TypeDef *)PWM3_BASE)
#define PWM4 ((PWM_TypeDef *)PWM4_BASE)
#define PWM5 ((PWM_TypeDef *)PWM5_BASE)
#define PWMG ((PWMG_TypeDef *)PWMG_BASE)

#define SDIO ((SDIO_TypeDef *)SDIO_BASE)

#define DMA ((DMA_TypeDef *)DMA_BASE)

#define CAN ((CAN_TypeDef *)CAN_BASE)

#define LCD ((LCD_TypeDef *)LCD_BASE)

#define CRC ((CRC_TypeDef *)CRC_BASE)

#define RTC ((RTC_TypeDef *)RTC_BASE)

#define WDT ((WDT_TypeDef *)WDT_BASE)

#define FLASH ((FLASH_Typedef *)FLASH_BASE)

#define SRAMC ((SRAMC_TypeDef *)SRAMC_BASE)

#define NORFLC ((NORFLC_TypeDef *)NORFLC_BASE)

#define SDRAMC ((SDRAMC_TypeDef *)SDRAMC_BASE)

typedef void (*Func_void_void)(void);

#include "SWM320_port.h"
#include "SWM320_gpio.h"
#include "SWM320_exti.h"
#include "SWM320_timr.h"
#include "SWM320_uart.h"
#include "SWM320_spi.h"
#include "SWM320_i2c.h"
#include "SWM320_pwm.h"
#include "SWM320_adc.h"
#include "SWM320_dma.h"
#include "SWM320_lcd.h"
#include "SWM320_can.h"
#include "SWM320_sdio.h"
#include "SWM320_flash.h"
#include "SWM320_norflash.h"
#include "SWM320_sdram.h"
#include "SWM320_sram.h"
#include "SWM320_crc.h"
#include "SWM320_rtc.h"
#include "SWM320_wdt.h"

#endif //__SWM320_H__
